## Set Up

In [4]:
import sqlalchemy
import sqlite3

In [16]:
sqlalchemy.create_engine('sqlite:///movies.db')
conn = sqlite3.connect("movies.db")
cursor = conn.cursor()
%reload_ext sql

NameError: name 'sqlalchemy' is not defined

In [15]:
sql sqlite:///movies.db

SyntaxError: invalid syntax (<ipython-input-15-8c1598bc1437>, line 1)

In [14]:
%%sql 
CREATE TABLE movies_table(
    id INTEGER PRIMARY KEY,
    name TEXT,
    genre TEXT,
    year INT,
    imdb_rating FLOAT);

UsageError: Cell magic `%%sql` not found.

In [8]:
movies = [(1,'Avatar','action',2009,7.9),(2,'Jurassic World','action',2015,7.3),
          (3,'The Avengers','action',2012,8.1),(4,'The Dark Knight','action',2009,9.0),
          (5,'Ghostbusters','comedy',1984,7.8),(6,'Rush Hour 2','comedy',2001,6.6),
          (7,'Big Hero 6','comedy',2014,7.9),(8,'Anaconda','horror',1997,4.6),
         (9,'Wolf','horror',1994,6.2),(10,'Friday the 13th','horror',2009,5.6),
         (11,'Titanic','romance',1997,7.7),(12,'Forrest Gump','romance',1994,8.8),
         (13,'The Twilight Saga: Eclipse','romance',2010,4.9),(14,'A Beautiful Mind','drama',2001,8.2),
         (15,'The Help','drama',2011,8.1),(16,'3 Men and a Baby','drama',1987,5.9)]

In [2]:
try:
    cursor.executemany("""INSERT INTO movies_table VALUES (?,?,?,?,?)""", movies)
except Exception as e:
    print(str(e))

name 'cursor' is not defined

In [11]:
conn.commit()

***
## Querys

One of the core purposes of the SQL language is to retrieve information stored in a database. This is commonly referred to as querying. Queries allow us to communicate with the database by asking questions and returning a result set with data relevant to the question.

### Select

* We want the name and the year of each movie

In [ ]:
%%sql 
SELECT name,year FROM movies_table

### Select As

* `AS` is a keyword in SQL that allows you to rename a column or table using an alias. The new name can be anything you want as long as you put it inside of single quotes.

In [ ]:
%%sql
SELECT name as 'Title' FROM movies_table

### Distinct

`DISTINCT` is used to return unique values in the output. It filters out all duplicate values in the specified column(s).

In [ ]:
%%sql 
 
SELECT DISTINCT genre FROM movies_table

### Where

In [ ]:
%%sql

SELECT * FROM movies_table
WHERE imdb_rating > 8

### Like

`LIKE` can be a useful operator when you want to compare similar values.

The movies table contains two films with similar titles, ‘Se7en’ and ‘Seven’.

How could we select all movies that start with ‘Se’ and end with ‘en’ and have exactly one character in the middle?

`SELECT * `

`FROM movies`

`WHERE name LIKE 'Se_en';`

**LIKE is a special operator used with the WHERE clause to search for a specific pattern in a column.**

`name LIKE 'Se_en'` is a condition evaluating the name column for a specific pattern.

`Se_en` represents a pattern with a wildcard character.

The `_` means you can substitute any individual character here without breaking the pattern. The names Seven and Se7en both match this pattern.

In [ ]:
%%sql 

SELECT * FROM movies_table
WHERE name like 'A_atar'

### Like II

The percentage sign `%` is another wildcard character that can be used with LIKE.
% is a wildcard character that matches zero or more missing letters in the pattern. For example:

* `A%` matches all movies with names that **begin** with letter ‘A’
* `%a` matches all movies that **end** with ‘a’

We can also use `%` both before and after a pattern:

`SELECT * ` <br>
`FROM movies` <br>
`WHERE name LIKE '%man%';`<br>

*Here, any movie that contains the word **‘man’**  in its name will be returned in the result.*

In [ ]:
%%sql 

SELECT * FROM movies_table 
WHERE name LIKE '%nic'

### Is Null

Unknown values are indicated by `NULL`.

It is not possible to test for` NULL` values with comparison operators, such as `=` and `!=`.

Instead, we will have to use these operators:

* IS NULL
* IS NOT NULL

In [17]:
%%sql 

SELECT * FROM movies_table
WHERE year IS NOT NULL

 * sqlite:///movies.db
Done.

[(1, 'Avatar', 'action', 2009, 7.9),
 (2, 'Jurassic World', 'action', 2015, 7.3),
 (3, 'The Avengers', 'action', 2012, 8.1),
 (4, 'The Dark Knight', 'action', 2009, 9.0),
 (5, 'Ghostbusters', 'comedy', 1984, 7.8),
 (6, 'Rush Hour 2', 'comedy', 2001, 6.6),
 (7, 'Big Hero 6', 'comedy', 2014, 7.9),
 (8, 'Anaconda', 'horror', 1997, 4.6),
 (9, 'Wolf', 'horror', 1994, 6.2),
 (10, 'Friday the 13th', 'horror', 2009, 5.6),
 (11, 'Titanic', 'romance', 1997, 7.7),
 (12, 'Forrest Gump', 'romance', 1994, 8.8),
 (13, 'The Twilight Saga: Eclipse', 'romance', 2010, 4.9),
 (14, 'A Beautiful Mind', 'drama', 2001, 8.2),
 (15, 'The Help', 'drama', 2011, 8.1),
 (16, '3 Men and a Baby', 'drama', 1987, 5.9)]

### Between

The `BETWEEN` operator is **used in a `WHERE` clause** to filter the result set within a certain range. It accepts two values that are either **numbers, text or dates**.

In [ ]:
%%sql 

SELECT * FROM movies_table
WHERE year BETWEEN 1997 AND 2009

### AND

Sometimes we want to combine multiple conditions in a `WHERE` clause to make the result set more specific and useful.

In [ ]:
%%sql 

SELECT * FROM movies_table
WHERE year BETWEEN 1997 AND 2009 AND
imdb_rating > 8

*With `AND`, both conditions must be true for the row to be included in the result.*

### Or

Similar to `AND`, the `OR` operator can also be used to combine multiple conditions in WHERE, but there is a fundamental difference:

* AND operator displays a row **if all the conditions are true**.
* OR operator displays a row **if any condition is true**.

In [ ]:
%%sql 

SELECT * FROM movies_table
WHERE year BETWEEN 1997 AND 2009 OR
imdb_rating >= 8

### Order By

We can sort the results using `ORDER BY`, either alphabetically or numerically. Sorting the results often makes the data more useful and easier to analyze.

* `ORDER BY` is a clause that indicates you want to sort the result set by a particular column.
* `name` is the specified column.

In [ ]:
%%sql
SELECT name FROM movies_table
ORDER BY name

* `DESC` is a keyword used in `ORDER BY` to sort the results in descending order (high to low or Z-A).
* `ASC` is a keyword used in `ORDER BY` to sort the results in ascending order (low to high or A-Z).

In [ ]:
%%sql 
SELECT * FROM movies_table
WHERE year BETWEEN 1997 AND 2001 AND name like '%a%'
ORDER BY name DESC

**Note**: *`ORDER BY` always goes after `WHERE` (if WHERE is present).*


### Limit

`LIMIT` is a clause that lets you specify the maximum number of rows the result set will have. This saves space on our screen and makes our queries run faster.

Here, we specify that the result set can’t have more than 6 rows.

In [ ]:
%%sql
SELECT * FROM movies_table
LIMIT 6

`LIMIT` always goes at the very end of the query. Also, it is not supported in all SQL databases.

### Case

A `CASE` statement allows us to create different outputs (usually in the SELECT statement). It is SQL’s way of handling if-then logic.

Suppose we want to condense the ratings in movies to three levels:

* If the rating is above 8, then it is Fantastic.

* If the rating is above 6, then it is Poorly Received.

* Else, Avoid at All Costs.

In [23]:
%%sql
SELECT name,
    CASE
        WHEN imdb_rating > 8 THEN 'Fantastic'
        WHEN imdb_rating > 6 THEN 'Poorly Received'
        ELSE 'Avoid at All Costs.'
    END AS 'Review'
FROM movies_table

 * sqlite:///movies.db
Done.

[('Avatar', 'Poorly Received'),
 ('Jurassic World', 'Poorly Received'),
 ('The Avengers', 'Fantastic'),
 ('The Dark Knight', 'Fantastic'),
 ('Ghostbusters', 'Poorly Received'),
 ('Rush Hour 2', 'Poorly Received'),
 ('Big Hero 6', 'Poorly Received'),
 ('Anaconda', 'Avoid at All Costs.'),
 ('Wolf', 'Poorly Received'),
 ('Friday the 13th', 'Avoid at All Costs.'),
 ('Titanic', 'Poorly Received'),
 ('Forrest Gump', 'Fantastic'),
 ('The Twilight Saga: Eclipse', 'Avoid at All Costs.'),
 ('A Beautiful Mind', 'Fantastic'),
 ('The Help', 'Fantastic'),
 ('3 Men and a Baby', 'Avoid at All Costs.')]